app/controllers/estoques_controller.rb

  def index
    @estoques = Estoque.all
---
SELECT "estoques".* FROM "estoques"

  def create
    @estoque = Estoque.new(estoque_params)

    respond_to do |format|
      if @estoque.save
---
INSERT INTO "estoques" ("nome", "descricao", "valor", "quantidade", "grupo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @estoque.update(estoque_params)
---
UPDATE "estoques" SET "valor" = ?, "updated_at" = ? WHERE "estoques"."id" = ?  [["valor", 729.0], ["updated_at", "2017-10-17 11:47:02.610726"], ["id", 2]]

  def destroy
    @estoque.destroy
---
DELETE FROM "estoques" WHERE "estoques"."id" = ?  [["id", 6]]

    def set_estoque
      @estoque = Estoque.find(params[:id])
---
SELECT  "estoques".* FROM "estoques" WHERE "estoques"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]